<?php // serfreeman1337 // 15.06.21 //

$mod_strings = [
    'LBL_CONFIG_ENDPOINT' => 'Настройки Вебхука',

    'LBL_CONFIG_TOKEN' => 'Токен',
    'LBL_CONFIG_TOKEN_TT' => 'Должен совпадать с тем, что указан в файле conf.yml.',

    'LBL_CONFIG_URL' => 'Адрес вебхука',
    'LBL_CONFIG_URL_TT' => 'Для функции "Звонок-по-Клику". Браузер пользователя направит запрос на этот адрес.',

    'LBL_CONFIG_WS' => 'Адрес веб-сокета',
    'LBL_CONFIG_URL_TT' => 'Для карточки звонка. Браузер пользователя подключится к этому адресу для получения событий карточки звонка.',

    'LBL_CONFIG_RELS' => 'Настройки связей',

    'LBL_CONFIG_RONCE' => 'Связать только один раз',
    'LBL_CONFIG_RONCE_TT' => 'Прекратить поиск связей после первой найденной записи.',

    'LBL_CONFIG_MODULE' => 'Модуль',
    'LBL_CONFIG_MODULE_TT' => 'Модуль для поиска связанных записей. Если вы не видете своего модуля здесь, проверьте, что он имеет связь с модулем "Звонки" и что у него есть поля с типом "Телефон".',

    'LBL_CONFIG_NFIELD' => 'Поле для имени',
    'LBL_CONFIG_NFIELD_TT' => 'Это поле будет отображено в карточке звонка. Если вы не видете своего поля здесь, проверьте что оно имеет тип "Текстовое поле".',

    'LBL_CONFIG_PFILED' => 'Поля для телефонов',
    'LBL_CONFIG_PFIELD_TT' => 'Поиск CallerID будет осуществлен по этим полям. Зажмите "CTRL", чтобы выбрать несколько полей. Если вы не видете своего поля здесь, проверьте что оно имеет тип "Телефон".',

    'LBL_CONFIG_SCREATE' => 'Ссылка для создания',
    'LBL_CONFIG_SCREATE_TT' => 'Отобразить ссылку для создания новой записи, если он не была найдена.',

    'LBL_CONFIG_UTILS' => 'Утилиты',
    'LBL_CONFIG_MDUR' => 'Добавить секунды к шаблону длительности звонка'
];
